/*
Задание 1
Дана строка. Необходимо написать метод, 
который отсортирует слова в строке по длине с помощью TreeMap.
слова с одинаковой длиной не должны “потеряться”.

Пример:
“Мороз и солнце день чудесный Еще ты дремлешь друг прелестный Пора красавица проснись”

Результат:
[и], [ты], [Еще], [день, друг, Пора], [Мороз], [солнце], [чудесный, дремлешь, проснись], [красавица], [прелестный]

*/

/* тут нужно использовать 
treemap<Integer, ArrayList<String>> 
ключ - количество букв
значение - слова с одинаковым количеством букв
*/


public class homework5_1 {
    public static void main(String[] args) {
        
    }
}
