import java.time.LocalDate;

/*1. Продумайте структуру класса Бульдожка. Какие поля и методы будут актуальны для приложения, которое является
а) информационной системой ухода за ней (запись на стрижку/помывку)
б) архивом выставки бульдожков
в) информационной системой Театра бульдожек имени Дарахвелидзе
Можно записать в текстовом виде, не обязательно реализовывать в java.
*/

public class practice6_2 {
    public static void main(String[] args) {
        
        practice6_2_bulldog dog = new practice6_2_bulldog("111111");
    }
}